# RollBack Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Transaction..::..RollBack Method
Transaction Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RollBack()()()() | Rolls back all changes made to the model during the transaction. |
| RollBack(FailureHandlingOptions) | Rolls back all changes made to the model during the transaction. |

# See Also
Transaction Class
Transaction Members
Autodesk.Revit.DB Namespace